In [4]:
import pandas as pd
import glob
import os

In [5]:
csvs_path=glob.glob("./data/*.csv")

In [6]:
for x in csvs_path:
    df = pd.read_csv(x)
    print(os.path.basename(x))
    print(df.dtypes)
    print("_________")

departments.csv
dept_no      object
dept_name    object
dtype: object
_________
dept_emp.csv
emp_no      int64
dept_no    object
dtype: object
_________
dept_manager.csv
dept_no    object
emp_no      int64
dtype: object
_________
employees.csv
emp_no           int64
emp_title_id    object
birth_date      object
first_name      object
last_name       object
sex             object
hire_date       object
dtype: object
_________
salaries.csv
emp_no    int64
salary    int64
dtype: object
_________
titles.csv
title_id    object
title       object
dtype: object
_________

In [14]:
ab=pd.read_csv("./data/salaries.csv")
ab

        emp_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228
...        ...     ...
300019  499995   40000
300020  499996   58058
300021  499997   49597
300022  499998   40000
300023  499999   63707

[300024 rows x 2 columns]